{
  "levels": {
    "0": {
      "level": 0,
      "min": 0,
      "max": 100,
      "character": null,
      "img": null,
      "img_grey": null
    },
    "1": {
      "level": 1,
      "min": 101,
      "max": 350,
      "character": "fish",
      "img": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/color/svg/1F41F.svg?sanitize=true",
      "img_grey": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/black/svg/1F41F.svg?sanitize=true"
    },
    "2": {
      "level": 2,
      "min": 351,
      "max": 750,
      "character": "frog",
      "img": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/color/svg/1F438.svg?sanitize=true",
      "img_grey": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/black/svg/1F438.svg?sanitize=true"
    },
    "3": {
      "level": 3,
      "min": 751,
      "max": 1000,
      "character": "duck",
      "img": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/color/svg/1F986.svg?sanitize=true",
      "img_grey": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/black/svg/1F986.svg?sanitize=true"
    },
    "4": {
      "level": 4,
      "min": 1001,
      "max": 1500,
      "character": "koala",
      "img": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/color/svg/1F428.svg?sanitize=true",
      "img_grey": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/black/svg/1F428.svg?sanitize=true"
    },
    "5": {
      "level": 5,
      "min": 1501,
      "max": 2000,
      "character": "cat",
      "img": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/color/svg/1F408.svg?sanitize=true",
      "img_grey": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/black/svg/1F408.svg?sanitize=true"
    },
    "6": {
      "level": 6,
      "min": 2001,
      "max": 2500,
      "character": "lion",
      "img": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/color/svg/1F981.svg?sanitize=true",
      "img_grey": "https://raw.githubusercontent.com/hfg-gmuend/openmoji/master/black/svg/1F981.svg?sanitize=true"
    }
  },
  "firebaseKeys": {
    "apiKey": "AIzaSyAHYmTOolAYDczaOp-I22YZQCMAXTSzlt8",
    "authDomain": "brainswipes.firebaseapp.com",
    "databaseURL": "https://brainswipes-default-rtdb.firebaseio.com",
    "projectId": "brainswipes",
    "storageBucket": "brainswipes.appspot.com",
    "messagingSenderId": "518258041913",
    "appId": "1:518258041913:web:ae6cbc61a715d9941659e8",
    "measurementId": "G-YNZSDHFLC7"
  },
  "tutorial": {
    "bucket": "brainswipes",
    "dataset": "BCP",
    "steps": {
      "MRIintro": [
        {
          "text":"<h1 id='header-MR-Intro'>Introduction to MRI</h1>"
        },
        {
          "text":"Magnetic Resonance Imaging (MRI) is a non-invasive technique that uses strong magnets and radio waves to see organs and tissues inside the body. In the field of neuroscience researchers use MRI to gather images of subjects' brains. This is called neuroimaging."
        },
        {
          "text":"Researchers gather images while the subject is at rest or while performing a task.<hr>Images gathered at rest are used to study the shape, size, organization and composition of the subject's brain. These images are called structural images or anatomical images.<hr>Images gathered while performing a task are used to study how the subject used their brain during that task. These images are called functional images. Techniques that gather these images are called Functional MRI or fMRI."
        },
        {
          "text":"MRI images are gathered as a series of cross-sectional images called slices resulting in a series of 2D images for every scan.",
          "image":"/add/series/of/raw/slices"
        },
        {
          "text": "The most widely used type of structural image is the T1-weighted image (T1). T1 images show the difference between gray matter and white matter in the brain. In T1 images of adult brains, white matter appears white and gray matter appears gray.",
          "image": "/static/tutorial_imgs/atlas_justimg.jpg"
        },
        {
          "text": "Another commonly used type of structural image is the T2-weighted image (T2). T2 images highlight the brain differently than T1 images. In T2 images of adult brains, white matter appears darker than gray matter.",
          "image":"/add/raw/T2"
        },
        {
          "text": "The primary type of functional image is a Blood Oxygen Level Dependent signal image or BOLD image. These images show the change in oxygen levels in the brain's blood over time. In isolation, functional images appear blurry.",
          "image": "/add/raw/BOLD"
        },
        {
          "text":"After gathering MRI images they are processed by a supercomputer. This makes it possible to accurately map a subject's brain and compare images to one another. One image can be compared to another type of image from the same subject, and to the images of any other subject."
        },
        {
          "text":"To help researchers map the structure of the cortical surface, the supercomputer draws lines to seperate gray matter and white matter. This is called surface delineation.",
          "image":"/add/before/after/delineation"
        },
        {
          "text":"To help researchers compare an image to other images of the same subject the supercomputer overlays one image on the other. This is called co-registration. Co-registration is most commonly used to compare data from functional images to data from anatomical images, allowing researchers to identify what parts of the brain is involved in a task. This is done by taking the delineations of one type of image and overlaying them on the image of another type. This is called functional registration."
        },
        {
          "text":"One subject's anatomy is not compared directly to another subject. To compare subject's anatomical images they are first compared to a standardized map of the brain called an atlas. This is done by slightly reshaping a subject's images to match the overall shape of the atlas. Comparing an image to an atlas in this way is called atlas registration.",
          "image":"/static/tutorial_imgs/mni_final.jpg"
        },
        {
          "text":"<h1 id='header-qa-intro'>Introduction to Quality Assessment</h1>"
        },
        {
          "text":"Ideally all images that are gathered via MRI and processed by a supercomputer can be used for analyses. However, some images are low quality and using them in analysis would generate poor results.<hr>Researchers have a standard set of metrics to determine whether the images are high enough quality to be used in analysis. The act of assesing the level of an image's quality is called Quality Assessment (QA).<hr>Though automated tools are being developed, the best way to perform QA is manually. This is a difficult task for datasets that include thousands of subjects. This task becomes acheivable when it is shared between many people."
        },
        {
          "text":"We welcome you to BrainSwipes, a central platform for neuroimaging datasets that need quality assessment. Below you will learn how to perform QA on processed images of the brain acquired through MRI.",
          "image":"/static/tutorial_imgs/action-swipe.png"
        },
        {
          "text":"<h1 id='header-Type-Imgs'>Types of Images in BrainSwipes</h1>"
        },
        {
          "text":"You will assess the quality of 3 categories of images. Surface delineations of anatomical images, atlas registrations and functional registrations."
        },
        {
          "text":"<h2>Surface Delineations of Anatomical Images</h2>"
        },
        {
          "text":"You will perform QA on individual T1 and T2 slices to determine the quality of their surface delineations."
        },
        {
          "text": "There are 3 standard angles used when researchers examine the brain. Image slices from each angle fall into a plane, the Coronal plane, Axial plane or Sagittal plane. The coronal plane is the plane seen when looking at a persons face or the back of their head. The axial plane is the plane seen looking at the top of their head. The sagittal plane is the plane seen looking at the sides of their head. Surface delineation is performed on all of these slices.",
          "image": "/static/tutorial_imgs/planes.JPG"
        },
        {
          "text": "Here is an example of how an individual, delineated T1 slice will look in the app.",
          "image":"/static/tutorial_imgs/sub-714783_ses-15mo_T1-Axial-BasalGangila-Putamen.png"
        },
        {
          "text": "Here is an example of how an individual, delineated T2 slice will look in the app.",
          "image":"/static/tutorial_imgs/sub-232633_ses-36mo_T2-Axial-BasalGangila-Putamen.png"
        },
        {
          "text":"<h2>Atlas Registration</h2>"
        },
        {
          "text":"You will perform QA on 9 slices of the same T1 to determine the quality of its registration to an atlas."
        },
        {
          "text": "Atlas registration on structural data is done in two ways. A T1 can be overlayed onto an atlas or an atlas can be overlayed onto a T1. Whichever way this is done, surface delineations of the first image are drawn over the second image.",
          "image": "/static/tutorial_imgs/atlast1horizontal.JPG"
        },
        {
          "text":"Here is an example of how a T1 registered to an atlas will look in the app.",
          "image":"/static/tutorial_imgs/sub-198202_ses-8mo_desc-T1wInAtlas.png"
        },
        {
          "text":"Here is an example of how an atlas registered to a T1 will look in the app. Registrations of an atlas onto a T1 will often have heavy red lines in the center sagittal slice.",
          "image":"/static/tutorial_imgs/sub-0051322_ses-MaxMunb_desc-AtlasInT1w.png"
        },
        {
          "text":"<h2>Functional Registration</h2>"
        },
        {
          "text":"You will perform QA on 9 slices of the same functional image to determine the quality of its registration to a T1."
        },
        {
          "text":"Functional Registration to a T1 is done in two ways. A functional image can be overlayed onto a structural image or structural image can be overlayed onto a functional image. Whichever way this is done, surface delineations of the first image are drawn over the second image.",
          "image": "/static/tutorial_imgs/sidebysiderest_testwidth.JPG"
        },
        {
          "text": "Here is an example of how a functional image registered to a T1 will look in the app. A functional image registered to a T1 will have sparse or dotted red lines because functional images are blurrier leading to the supercomputer drawing less delineations.",
          "image":"/static/tutorial_imgs/sub-0050397_ses-UM2_task-rest_run-01_desc-TaskInT1.png"
        },
        {
          "text": "Here is an example of how a T1 registered to a functional image will look in the app. A T1 registered to a functional image will have a blurry background image because functional images are blurry.",
          "image":"/static/tutorial_imgs/sub-470431_ses-9mo_task-rest_run-004_desc-T1InTask.png"
        },
        {
          "text":"<h1 id='header-overall-QA'>Assessing the Quality of Images</h1>"
        },
        {
          "text":"In the next sections you will learn how to assess the quality of a processed image. We will define QA metrics for the three image types defined above, and some overall metrics.<hr>We will use short checklists to assess the quality of images. All boxes must be checked for an image to pass."
        },
        {
          "text":"<h1 id='header-Surf-Delin'>Assessing the Quality of Surface Delineations</h1>"
        },
        {
          "text":"<h2>Basic Criteria</h2><hr>A quality surface delineation will accurately delineate the cortical surface. Black lines will be drawn between white matter and gray matter and nowhere else. Red lines will be drawn between gray matter and cerebrospinal fluid and nowhere else. Brain images will not appear warped.",
          "checks": { "surfaceDelineation": [true, true, true] }
        },
        {
          "text":"This image has accurate surface delineation.",
          "image":"/perfect/surface/delineation",
          "checks": { "surfaceDelineation": [true, true, true] }
        },
        {
          "text": "Surface delineation is only concerned with the outer area of the brain called the cortical surface. A quality surface delineation does not depend on the subcortical regions highlighted below. In this image, delineation of gray matter is not accurate in the subcortical region, but is accurate on the cortical surface so it passes.",
          "image": "/static/tutorial_imgs/subcort.JPG",
          "checks": { "surfaceDelineation": [true, true, true] }
        },
        {
          "text":"<h2>Common Errors</h1>"
        },
        {
          "text": "Warps of the brain, skull, and surface delineations are caused by poor atlas registration. These warps appear to 'pull' the brain and surface delineations. Warped images fail QC.",
          "image": "/static/tutorial_imgs/15-T1Surf.jpg",
          "checks": { "surfaceDelineation": [true, true, false] }
        },
        {
          "text": "White matter extension is when the black line misidentifies gray matter that neighbors white matter as white matter, extending the boundary of white matter into the gray matter. This image has white matter extension in the front of the brain and fails QC.",
          "image": "/static/tutorial_imgs/whitematter.PNG",
          "checks": { "surfaceDelineation": [false, true, true] }
        },
        {
          "text": "A surface delineation can be drawn outside of the brain and extend into the dura or skull. When this happens, an image fails QC.",
          "image": "/static/tutorial_imgs/duraskull.JPG",
          "checks": { "surfaceDelineation": [false, false, true] }
        },
        {
          "text": "Motion artifacts occur when the participant is moving in the scanner. Motion artifacts do not cause an image to fail QA, but can lead to innacurate surface delineation. Motion artifacts include blurriness and ringing. A clear image is included for comparison.",
          "tabs": [
            {"title": "Clear", "image": "/clear/image" },
            {"title": "Blurry", "image": "/static/tutorial_imgs/blurryfail.JPG" },
            {"title": "Ringing", "image": "/static/tutorial_imgs/ringingfail.JPG" }
          ]
        },
        {  
          "text": "Here is a comparison of a clear image, an image that is blurry but still has good delineation, and an image where blurriness causes poor delineation.",
          "tabs": [
            {"title": "Clear", "image": "/clear/image", "checks": { "surfaceDelineation": [true, true, true] } },
            {"title": "Slightly Blurry", "image": "/static/tutorial_imgs/blurrypass.JPG", "checks": { "surfaceDelineation": [true, true, true] } },
            {"title": "Very Blurry", "image": "/static/tutorial_imgs/blurryfail.JPG", "checks": { "surfaceDelineation": [false, false, true] } }
          ]
        },
        {
          "text": "Here is a comparison of a clear image, an image that has minor ringing but is still accurately delineated, and an image where ringing causes poor delineation.",
          "tabs": [
            {"title": "Clear", "image": "/clear/image", "checks": { "surfaceDelineation": [true, true, true] } },
            {"title": "Slight Ringing", "image": "/static/tutorial_imgs/ringingpass.JPG", "checks": { "surfaceDelineation": [true, true, true] } },
            {"title": "Heavy Ringing", "image": "/static/tutorial_imgs/ringingfail.JPG", "checks": { "surfaceDelineation": [false, false, true] } }
          ]
        },
        {
          "text": "An image is bad quality when the white and gray matter surface delineations cross over each other.",
          "image": "/static/tutorial_imgs/14-T1Surf.jpg",
          "checks": { "surfaceDelineation": [false, false, true] }
        },
        {
          "text":"<h1 id='header-Atl-Reg'>Assessing the Quality of Atlas Registration</h1>"
        },
        {
          "text":"<h2>Basic Criteria</h2><hr>A quality atlas registration will correctly and accurately register an atlas to a T1 or a T1 to an atlas. The outer boundaries of the overlayed delineations will align with the outer boundaries of the underlying image, with small or no gaps. Images are free of warps leading to missing pieces in the T1 image.",
          "checks":{"atlasRegistration":[true, true]}
        },
        {
          "text":"This image is a T1 accurately registered to an atlas.",
          "image":"/perfect/T1InAtlas",
          "checks":{"atlasRegistration":[true, true]}
        },
        {
          "text":"This image is an atlas accurately registered to a T1.",
          "image":"/perfect/AtlasInT1",
          "checks":{"atlasRegistration":[true, true]}
        },
        {
          "text":"<h2>Common Errors</h1>"
        },
        {
          "text":"When a T1 is registered to an atlas it's boundaries may not exactly align. Some small gaps are acceptable, but large gaps will lead to an image failing QC. Here is a set of images where a T1 is registered to an atlas, ranging from the T1 being too small to too large.",
          "tabs":[
            {"title":"Very Small", "image": "/static/tutorial_imgs/insidefail.JPG", "checks": { "atlasRegistration": [false, true] } },
            {"title":"Slightly Small", "image": "/static/tutorial_imgs/insidepass.JPG", "checks": { "atlasRegistration": [true, true] } },
            {"title":"Same Size", "image": "/same/size/T1InAtlas", "checks": { "atlasRegistration": [true, true] } },
            {"title":"Slightly Large", "image": "/static/tutorial_imgs/outsidepass.JPG", "checks": { "atlasRegistration": [true, true] } },
            {"title":"Very Large", "image": "/static/tutorial_imgs/outsidefail.JPG", "checks": { "atlasRegistration": [false, true] } }
          ]
        },
        {
          "text":"When an atlas is registered to a T1 it's boundaries may not exactly align. Some small gaps are acceptable, but large gaps will lead to an image failing QC. Here is a set of images where an atlas is registered to a T1, ranging from the atlas being too small to too large.",
          "tabs":[
            {"title":"Very Small", "image": "/very/small/AtlasInT1", "checks": { "atlasRegistration": [false, true] } },
            {"title":"Slightly Small", "image": "/slightly/small/AtlasInT1", "checks": { "atlasRegistration": [true, true] } },
            {"title":"Same Size", "image": "/same/size/AtlasInT1", "checks": { "atlasRegistration": [true, true] } },
            {"title":"Slightly Large", "image": "/slightly/large/AtlasInT1", "checks": { "atlasRegistration": [true, true] } },
            {"title":"Very Large", "image": "/very/large/AtlasInT1", "checks": { "atlasRegistration": [false, true] } }
          ]
        },
        {
          "text":"Registering a T1 to an atlas is done by reshaping the T1. Mistakes in this process can cause atlas registrations where the T1 is warped. In this image the boundaries of the T1 and atlas match up rather closely, but a warp in the T1 leads to a missing area in one of the slices. This fails QC.",
          "image":"/static/tutorial_imgs/warpedAtlasInT1.png",
          "checks":{"atlasRegistration":[true, false]}
        },
        {
          "text": "If an image has no red overlay click the HELP button and flag the image. This is a problem with how the overlaid image was created, not the registration.",
          "image": "/static/tutorial_imgs/blank_help_arrow.JPG"
        },
        {
          "text":"<h1 id='header-Func-Reg'>Assesing the Quality of Functional Registration</h1>"
        },
        {
          "text":"<h2>Basic Criteria</h2><hr>A quality functional registration will correctly and accurately register a functional image to a T1 or a T1 to a functional image. The outer boundaries of the overlayed delineations will align with the outer boundaries of the underlying image, with small or no gaps. Images are free of warps leading to missing pieces or misshapen brains. The functional image captures the vast majority of the brain.",
          "checks":{"functionalRegistration":[true, true, true]}
        },
        {
          "text":"This image is a functional image accurately registered to a T1 image.",
          "image":"/perfect/taskInT1",
          "checks":{"functionalRegistration":[true, true, true]}
        },
        {
          "text":"This image is a T1 image accurately registered to a functional image.",
          "image":"/perfect/T1inTask",
          "checks":{"functionalRegistration":[true, true, true]}
        },
        {
          "text":"<h2>Common Errors</h1>"
        },
        {
          "text":"Acquisition errors occur when the scanner does not gather data of the entire brain. These errors include field of view cut-off and signal dropout, which are described below. In functional data acquisition errors do not automatically cause the image to fail QC, but can lead to failure if they are extreme.",
          "tabs": [
            {"title":"No Acquisition Errors", "image": "/no/cutoff" },
            {"title":"Field of View Cut-off", "image": "/static/tutorial_imgs/failwithtexttest.JPG" },
            {"title":"Signal Dropout", "image": "/static/tutorial_imgs/example3.JPG" }
          ]
        },
        {
          "text": "Field of view cut-off is when the top or bottom of a functional image stops in a hard line. This occurs when the participant's head is not correctly aligned in the scanner. Minor cut-off of the brainstem is acceptable. Below is a set of functional images registered to T1 images with varying levels of cut-off.",
          "tabs": [
            {"title":"No Cut-Off", "image": "/no/cutoff", "checks":{"functionalRegistration":[true, true, true]}},
            {"title":"Minor Cut-Off", "image": "/static/tutorial_imgs/passwithtexttest.JPG", "checks":{"functionalRegistration":[true, true, true]}},
            {"title":"Major Cut-Off", "image": "/static/tutorial_imgs/failwithtexttest.JPG", "checks":{"functionalRegistration":[false, true, false]}}
          ]
        },
        {
          "text": "When functional images are the underlying image, field of view cut-off will appear as black space between the overlay and underlay. Below is a set of T1 images registered to functional images with varying levels of cut-off.",
          "tabs": [
            {"title":"No Cut-Off", "image": "/no/cutoff", "checks":{"functionalRegistration":[true, true, true]}},
            {"title":"Minor Cut-Off", "image": "/static/tutorial_imgs/passFOV.JPG", "checks":{"functionalRegistration":[true, true, true]}},
            {"title":"Major Cut-Off", "image": "/cutoff/t1InTask", "checks":{"functionalRegistration":[false, true, false]}}
          ]
        },
        {
          "text": "Signal dropout occurs where the scanner cannot acquire data during a scan. There are many reasons this can occur, and it can occur anywhere in the brain. Below is a set of functional images registered to T1 images with varying levels of signal dropout.",
          "tabs": [
            {"title":"No Dropout", "image": "/no/dropout", "checks":{"functionalRegistration":[true, true, true]}},
            {"title":"Minor Dropout", "image": "/static/tutorial_imgs/example4.JPG", "checks":{"functionalRegistration":[true, true, true]}},
            {"title":"Major Dropout", "image": "/static/tutorial_imgs/example3.JPG", "checks":{"functionalRegistration":[true, true, false]}}
          ]
        },
        {
          "text": "When functional images are the underlying image, signal dropout will appear as black space between the overlay and underlay. Below is a set of T1 images registered to functional images with varying levels of signal dropout.",
          "tabs": [
            {"title":"No Dropout", "image": "/no/dropout", "checks":{"functionalRegistration":[true, true, true]}},
            {"title":"Minor Dropout", "image": "/T1inTask/minor/dropout", "checks":{"functionalRegistration":[true, true, true]}},
            {"title":"Major Dropout", "image": "/T1inTask/major/dropout", "checks":{"functionalRegistration":[false, true, false]}}
          ]
        },
        {
          "text": "Ignore movement artifacts when assessing the quality of the functional registration. \nMovement artifacts occur when the participant is moving too much during the fMRI scan but still is a PASS if the T1 and fMRI align well.",
          "image": "/static/tutorial_imgs/movementpass.JPG"
        },
        {
          "text": "Ignore warped brain shapes when assessing the quality of the functional registration. \nWarped brains are due to poor registration of the T1 to the MNI atlas and are not a problem with the functional scan.",
          "image": "/static/tutorial_imgs/ignorewarp.JPG"
        }
      ],
      "examples": [
        {
          "text":"<h1 id='using-swipes'>Using the BrainSwipes interface</h1>"
        },
        {
          "text": "Pass an image by clicking the 'Pass' button. On a touch screen you can swipe the image to the right.",
          "pointer": "sub-232633_ses-36mo_T2-Axial-BasalGangila-Putamen",
          "tutorialStep": 1
        },
        {
          "text": "Fail an image by clicking the 'Fail' button. On a touch screen you can swipe the image to the left.",
          "pointer": "sub-764612_ses-28mo_task-rest_run-001_desc-TaskInT1",
          "tutorialStep": 0
        },
        {
          "text": "If you are unsure, click help for guidance or to flag an image for further review.",
          "pointer": "sub-764612_ses-28mo_task-rest_run-001_desc-TaskInT1",
          "tutorialStep": 2
        },
        {
          "text": "Thank you for performing QA on neuroimaging datasets. Every swipe helps!",
          "tutorialCompleted": true
        }
      ]
    },
    "checklists": {
      "surfaceDelineation":[
        "Black lines lie between white matter and gray matter on the cortical surface",
        "Red lines lie between gray matter and cerebrospinal fluid on the cortical surface",
        "Images maintain original brain shape"
      ],
      "atlasRegistration":[
        "Small or no gaps between the outer edges of the overlying delineation and the underlying image",
        "Images maintain original brain shape"
      ],
      "functionalRegistration":[
        "Small or no gaps between the outer edges of the overlying delineation and the underlying image",
        "Images maintain original brain shape",
        "Functional image captures the vast majority of the brain"
      ]
    },
    "extraImages": [
      {
        "text": "Below are examples of good and bad quality surface delineation:",
        "image": "/static/tutorial_imgs/17-T1Surf.jpg"
      },
      {
        "text": "",
        "image": "/static/tutorial_imgs/18-T1Surf.jpg"
      },
      {
        "text": "",
        "image": "/static/tutorial_imgs/16-T1Surf.jpg"
      },
      {
        "text": "",
        "image": "/static/tutorial_imgs/19-T1Surf.jpg"
      },
      {
        "text": "",
        "image": "/static/tutorial_imgs/20-T1Surf.jpg"
      }
    ]
  }
}
