{
    "BRAINSTEM":"The portion of the brain that connects the brain to the spinal cord. It is made up of the pons, midbrain, and medulla oblongata. Its primary function is to regulate involuntary actions such as breathing, balance and heart rate.",
    "CEREBELLUM":"Also referred to as “the little brain”, the portion of the brain located between the cerebrum and brainstem that consists of 2 hemispheres and controls complex voluntary motor functions such as maintaining posture, balance and walking.",
    "CEREBRAL CORTEX": "The coiled outer gray matter that covers the cerebrum. Cortex is the Latin for “bark”. This structure is involved in higher-level processes such as consciousness, language, memory, thought, learning, decision making, reasoning, intelligence, emotion, and personality.",
    "DURA": "The outermost layer of connective tissue that makes up the meninges. It functions as a protective envelope for the central nervous system and supplies a system for venous drainage from the brain through the dural sinuses.",
    "FRONTAL LOBE":"The largest of the 4 major lobes, it is the anterior-most portion of the brain and is responsible for high-level cognitive functions including reasoning, problem solving, motor skills, attention, memory, emotional regulation, communication and social interaction.",
    "GRAY MATTER": "The outermost layer of the brain that contains a high concentration of neuronal cell bodies, axon terminals, and dendrites. Within the gray matter is where all synapses take place in the brain. Its functions include receiving information and regulating outgoing information.",
    "GYRI": "Raised ridges of gray matter found on the cerebral cortex that are responsible for increasing the surface area of the brain.",
    "PREFRONTAL REGION":"The frontmost section of the frontal lobe. It is involved in a variety of complex functions including personality and planning.",
    "SKULL": "The skeletal structure that protects the brain from injury.",
    "SULCI": "Grooves or depressions in the cerebral cortex that surround gyri that help to increase the surface area of the brain and to form brain divisions",
    "SUBCORTICAL":"A group of gray matter neural formations found below the cortex that include the diencephalon, pituitary gland, basal ganglia, and limbic structures which are responsible for the processing and relaying of neural inputs between different parts of the brain.",
    "SUPERIOR PARIETAL":"This is the region of the brain that forms the association of the parietal lobe and the cortex. It is involved in visuospatial perception/spatial reasoning and attention.",
    "TEMPORAL LOBE": "Often referred to as the “neocortex”, the temporal lobe is located in the middle cranial fossa and contains the hippocampus and amygdala. The temporal lobe responsible for preserving and processing memories and integrating them with sensations such as taste, sound, smell, and sight.",
    "WHITE MATTER": "Brain tissue consisting primarily of myelin-covered axons that extend from nerve cell bodies in the gray matter of the central nervous system. Its function is to transmit information to other parts of the brain, spinal cord, and body.",
    "AXIAL PLANE":"A horizontal cross section view of the brain using MRI that primarily allows visualization of superior lobes of the cerebrum.",
    "ATLAS REGISTRATION":"A method of comparing a subject's images to a standard atlas. This allows for the pooling and comparison of experimental findings across laboratories.",
    "ATLAS":"A mapping of the brain that provides a standardized set of coordinates to determine specific sites.",
    "ANATOMICAL DATA": "Also known as Structural Data. This is used to study the shape, integrity, volume and developmental changes in the brain.",
    "CO-REGISTRATION":"The alignment and overlay of fMRI data from a single subject with that subject's own but separately acquired anatomic imaging study.",
    "CORONAL PLANE":"A frontal view of the brain using MRI that primarily allows visualization of the corpus callosum, frontal lobe, temporal lobes, lateral and 3rd ventricles, white matter structures and basal ganglia.",
    "FMRI REGISTRATION":"The alignment and overlay of multiple fMRIs taken at different times from the same subject.",
    "FMRI":"Functional Magnetic Resonance Imaging. A non-invasive imaging technique for mapping brain activity by measuring changes in metabolism, chemical composition, blood flow and absorption.",
    "IMAGE OVERLAY":"A computer display tactic that superimposes images over the viewer's direct view to create an augmented image.",
    "SAGITTAL PLANE":"A vertical cross view of the brain using MRI that divides the brain between left and right sides that primarily allows visualization of the 3 major parts of the brain: cerebrum, cerebellum and brainstem, gray and white matter, and the 3rd and 4th ventricles.",
    "SURFACE DELINEATION":"The line indicating the exact position of the boundary of the cortical surface.",
    "STRUCTURAL IMAGE": "Also known as an Anatomical Image. This is used to study the shape, integrity, volume and developmental changes in the brain.",
    "T1-WEIGHTED IMAGE":"A structural image where data is collected with relatively short radio pulses. In adults these images are characterized by darker cerebrospinal fluid.",
    "T1-WEIGHTED IMAGING":"A structural image where data is collected with relatively short radio pulses. In adults these images are characterized by darker cerebrospinal fluid.",
    "T1":"A structural image where data is collected with relatively short radio pulses. In adults these images are characterized by darker cerebrospinal fluid.",
    "T2-WEIGHTED IMAGE":"A structural image where data is collected with relatively long radio pulses. In adults these images are characterized by lighter cerebrospinal fluid.",
    "MNI":"Montreal Neuroligical Institue. A research and medical center dedicated to neuroscience. It is part of the McGill University Health Center network",
    "STRUCTURAL MRI":"Magnetic Resonance Imaging. A non-invasive imaging technique that provides static anatomical information.",
    "FUNCTIONAL MRI":"A non-invasive imaging technique for mapping brain activity by measuring changes in metabolism, chemical composition, blood flow and absorption.",
    "FUNCTIONAL DATA":"Data acquired through fMRI",
    "CEREBROSPINAL FLUID":"",
    "DELINEATED":"A boundary has been drawn on the cortical surface seperating different types of brain tissue.",
    "REGISTERED":"Geometrically aligned to images of other scans or an atlas.",
    "FUNCTIONAL REGISTRATION":"The alignment and overlay of multiple fMRIs taken at different times from the same subject.",
    "FIELD OF VIEW":"The dimensions of the region included in a scan."
}